rayleighBenard2DTestCase_dt5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.0221;
scale 0.0221;

vertices
(
    (-1 -1 -0.001) 
    (1 -1 -0.001) 
    (1 1 -0.001)  
    (-1 1 -0.001) 
    (-1 -1 0.001)
    (1 -1 0.001) 
    (1 1 0.001) 
    (-1 1 0.001) 
);
blocks
(
hex (0 1 2 3 4 5 6 7)  (46 46 1) simpleGrading (1 1 1)
);


boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);



edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
